''' Заполните массив элементами арифметической прогрессии.
Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.
Формула для получения n-го члена прогрессии:
an = a1 + (n-1) * d.
Каждое число вводится с новой строки.'''

a = int(input('Введите первый член прогрессии: '))
d = int(input('Введите разность прогрессии: '))
n = int(input('Введите количество элементов списка: '))

progress = []

for i in range(n):
    progress.append(a + d * i)

print(f'Заполненный список c разностью в {d}: ', progress)
